### YamlMime:RESTOperation
uid: management.azure.com.securityinsights.stable.bookmarks.get
name: Get
service: Sentinel
groupName: Bookmarks
apiVersion: 2021-10-01
summary: Gets a bookmark.
consumes:
- application/json
produces:
- application/json
paths:
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.OperationalInsights/workspaces/{workspaceName}/providers/Microsoft.SecurityInsights/bookmarks/{bookmarkId}?api-version=2021-10-01
uriParameters:
- name: subscriptionId
  in: path
  isRequired: true
  description: The ID of the target subscription.
  types:
  - uid: string
- name: resourceGroupName
  in: path
  isRequired: true
  description: The name of the resource group. The name is case insensitive.
  types:
  - uid: string
- name: workspaceName
  in: path
  isRequired: true
  description: The name of the workspace.
  types:
  - uid: string
- name: bookmarkId
  in: path
  isRequired: true
  description: Bookmark ID
  types:
  - uid: string
- name: api-version
  in: query
  isRequired: true
  description: The API version to use for this operation.
  types:
  - uid: string
responses:
- name: 200 OK
  description: OK, Operation successfully completed
  types:
  - uid: Bookmark
- name: Other Status Codes
  description: Error response describing why the operation failed.
  types:
  - uid: CloudError
requestHeader: []
definitions:
- name: Bookmark
  description: Represents a bookmark in Azure Security Insights.
  kind: object
  properties:
  - name: properties.created
    description: The time the bookmark was created
    types:
    - uid: string
  - name: properties.createdBy
    description: Describes a user that created the bookmark
    types:
    - uid: UserInfo
  - name: properties.displayName
    description: The display name of the bookmark
    types:
    - uid: string
  - name: properties.labels
    description: List of labels relevant to this bookmark
    types:
    - uid: string
      isArray: true
  - name: properties.notes
    description: The notes of the bookmark
    types:
    - uid: string
  - name: properties.query
    description: The query of the bookmark.
    types:
    - uid: string
  - name: properties.queryResult
    description: The query result of the bookmark.
    types:
    - uid: string
  - name: properties.updated
    description: The last time the bookmark was updated
    types:
    - uid: string
  - name: properties.updatedBy
    description: Describes a user that updated the bookmark
    types:
    - uid: UserInfo
  - name: properties.eventTime
    description: The bookmark event time
    types:
    - uid: string
  - name: properties.queryStartTime
    description: The start time for the query
    types:
    - uid: string
  - name: properties.queryEndTime
    description: The end time for the query
    types:
    - uid: string
  - name: properties.incidentInfo
    description: Describes an incident that relates to bookmark
    types:
    - uid: IncidentInfo
  - name: etag
    description: Etag of the azure resource
    types:
    - uid: string
  - name: id
    isReadyOnly: true
    description: Fully qualified resource ID for the resource. Ex - /subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/{resourceProviderNamespace}/{resourceType}/{resourceName}
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: The name of the resource
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: The type of the resource. E.g. "Microsoft.Compute/virtualMachines" or "Microsoft.Storage/storageAccounts"
    types:
    - uid: string
  - name: systemData
    isReadyOnly: true
    description: Azure Resource Manager metadata containing createdBy and modifiedBy information.
    types:
    - uid: systemData
- name: CloudError
  description: Error response structure.
  kind: object
  properties:
  - name: error
    description: Error data
    types:
    - uid: CloudErrorBody
- name: UserInfo
  description: User information that made some action
  kind: object
  properties:
  - name: email
    isReadyOnly: true
    description: The email of the user.
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: The name of the user.
    types:
    - uid: string
  - name: objectId
    description: The object id of the user.
    types:
    - uid: string
- name: IncidentInfo
  description: Describes related incident information for the bookmark
  kind: object
  properties:
  - name: incidentId
    description: Incident Id
    types:
    - uid: string
  - name: severity
    description: The severity of the incident
    types:
    - uid: IncidentSeverity
  - name: title
    description: The title of the incident
    types:
    - uid: string
  - name: relationName
    description: Relation Name
    types:
    - uid: string
- name: systemData
  description: Metadata pertaining to creation and last modification of the resource.
  kind: object
  properties:
  - name: createdBy
    description: The identity that created the resource.
    types:
    - uid: string
  - name: createdByType
    description: The type of identity that created the resource.
    types:
    - uid: createdByType
  - name: createdAt
    description: The timestamp of resource creation (UTC).
    types:
    - uid: string
  - name: lastModifiedBy
    description: The identity that last modified the resource.
    types:
    - uid: string
  - name: lastModifiedByType
    description: The type of identity that last modified the resource.
    types:
    - uid: createdByType
  - name: lastModifiedAt
    description: The timestamp of resource last modification (UTC)
    types:
    - uid: string
- name: CloudErrorBody
  description: Error details.
  kind: object
  properties:
  - name: code
    isReadyOnly: true
    description: An identifier for the error. Codes are invariant and are intended to be consumed programmatically.
    types:
    - uid: string
  - name: message
    isReadyOnly: true
    description: A message describing the error, intended to be suitable for display in a user interface.
    types:
    - uid: string
- name: IncidentSeverity
  description: The severity of the incident
  kind: enum
  properties:
  - name: High
    description: High severity
    types:
    - uid: string
  - name: Medium
    description: Medium severity
    types:
    - uid: string
  - name: Low
    description: Low severity
    types:
    - uid: string
  - name: Informational
    description: Informational severity
    types:
    - uid: string
- name: createdByType
  description: The type of identity that created the resource.
  kind: enum
  properties:
  - name: User
    types:
    - uid: string
  - name: Application
    types:
    - uid: string
  - name: ManagedIdentity
    types:
    - uid: string
  - name: Key
    types:
    - uid: string
examples:
- name: Get a bookmark.
  request:
    uri: GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5?api-version=2021-10-01
    codeTab: |+
      # [HTTP](#tab/HTTP)
      ``` http
      GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5?api-version=2021-10-01
      ```

      # [Go](#tab/Go)
      ``` go
      package armsecurityinsights_test

      import (
      	"context"
      	"log"

      	"github.com/Azure/azure-sdk-for-go/sdk/azidentity"
      	"github.com/Azure/azure-sdk-for-go/sdk/resourcemanager/securityinsights/armsecurityinsights"
      )

      // Generated from example definition: https://github.com/Azure/azure-rest-api-specs/tree/main/specification/securityinsights/resource-manager/Microsoft.SecurityInsights/stable/2021-10-01/examples/bookmarks/GetBookmarkById.json
      func ExampleBookmarksClient_Get() {
      	cred, err := azidentity.NewDefaultAzureCredential(nil)
      	if err != nil {
      		log.Fatalf("failed to obtain a credential: %v", err)
      	}
      	ctx := context.Background()
      	client, err := armsecurityinsights.NewBookmarksClient("d0cfe6b2-9ac0-4464-9919-dccaee2e48c0", cred, nil)
      	if err != nil {
      		log.Fatalf("failed to create client: %v", err)
      	}
      	res, err := client.Get(ctx,
      		"myRg",
      		"myWorkspace",
      		"73e01a99-5cd7-4139-a149-9f2736ff2ab5",
      		nil)
      	if err != nil {
      		log.Fatalf("failed to finish the request: %v", err)
      	}
      	// TODO: use response item
      	_ = res
      }

      ```
      Read this [SDK documentation](https://github.com/Azure/azure-sdk-for-go/blob/sdk%2Fresourcemanager%2Fsecurityinsights%2Farmsecurityinsights%2Fv1.0.0/sdk/resourcemanager/securityinsights/armsecurityinsights/README.md) on how to add the SDK to your project and authenticate.
  responses:
  - statusCode: "200"
    body: >-
      {
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "name": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
        "type": "Microsoft.SecurityInsights/bookmarks",
        "etag": "\"0300bf09-0000-0000-0000-5c37296e0000\"",
        "properties": {
          "displayName": "My bookmark",
          "createdBy": {
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
            "email": "john@contoso.com",
            "name": "john doe"
          },
          "updatedBy": {
            "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
            "email": "john@contoso.com",
            "name": "john doe"
          },
          "updated": "2019-01-01T13:15:30Z",
          "created": "2019-01-01T13:15:30Z",
          "notes": "Found a suspicious activity",
          "labels": [
            "Tag1",
            "Tag2"
          ],
          "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
          "queryResult": "Security Event query result",
          "incidentInfo": {
            "incidentId": "DDA55F97-170B-40B9-B8ED-CBFD05481E7D",
            "severity": "Low",
            "title": "New case 1",
            "relationName": "4bb36b7b-26ff-4d1c-9cbe-0d8ab3da0018"
          }
        }
      }
security:
- name: azure_auth
  type: oauth2
  description: Azure Active Directory OAuth2 Flow
  flow: implicit
  authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize
  scopes:
  - name: user_impersonation
    description: impersonate your user account
metadata:
  description: >
    Learn more about Sentinel service - Gets a bookmark.
errorCodes: []
