### YamlMime:RESTOperation
uid: management.azure.com.securityinsights.bookmarks.list
name: List
service: Sentinel
groupName: Bookmarks
apiVersion: 2020-01-01
summary: Gets all bookmarks.
consumes:
- application/json
produces:
- application/json
paths:
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.OperationalInsights/workspaces/{workspaceName}/providers/Microsoft.SecurityInsights/bookmarks?api-version=2020-01-01
uriParameters:
- name: subscriptionId
  in: path
  isRequired: true
  description: Azure subscription ID
  types:
  - uid: string
  pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$
- name: resourceGroupName
  in: path
  isRequired: true
  description: The name of the resource group within the user's subscription. The name is case insensitive.
  types:
  - uid: string
  pattern: ^[-\w\._\(\)]+$
- name: workspaceName
  in: path
  isRequired: true
  description: The name of the workspace.
  types:
  - uid: string
- name: api-version
  in: query
  isRequired: true
  description: API version for the operation
  types:
  - uid: string
responses:
- name: 200 OK
  description: OK, Operation successfully completed
  types:
  - uid: BookmarkList
- name: Other Status Codes
  description: Error response describing why the operation failed.
  types:
  - uid: CloudError
requestHeader: []
definitions:
- name: BookmarkList
  description: List all the bookmarks.
  kind: object
  properties:
  - name: nextLink
    isReadyOnly: true
    description: URL to fetch the next set of cases.
    types:
    - uid: string
  - name: value
    description: Array of bookmarks.
    types:
    - uid: Bookmark
      isArray: true
- name: CloudError
  description: An error response for a resource management request.
  kind: object
  properties:
  - name: error
    description: "Error Response  \nThe error object of the CloudError response"
    types:
    - uid: ErrorResponse
- name: Bookmark
  description: Represents a bookmark in Azure Security Insights.
  kind: object
  properties:
  - name: properties.created
    description: The time the bookmark was created
    types:
    - uid: string
  - name: properties.createdBy
    description: Describes a user that created the bookmark
    types:
    - uid: UserInfo
  - name: properties.displayName
    description: The display name of the bookmark
    types:
    - uid: string
  - name: properties.labels
    description: List of labels relevant to this bookmark
    types:
    - uid: string
      isArray: true
  - name: properties.notes
    description: The notes of the bookmark
    types:
    - uid: string
  - name: properties.query
    description: The query of the bookmark.
    types:
    - uid: string
  - name: properties.queryResult
    description: The query result of the bookmark.
    types:
    - uid: string
  - name: properties.updated
    description: The last time the bookmark was updated
    types:
    - uid: string
  - name: properties.updatedBy
    description: Describes a user that updated the bookmark
    types:
    - uid: UserInfo
  - name: properties.eventTime
    description: The bookmark event time
    types:
    - uid: string
  - name: properties.queryStartTime
    description: The start time for the query
    types:
    - uid: string
  - name: properties.queryEndTime
    description: The end time for the query
    types:
    - uid: string
  - name: properties.incidentInfo
    description: Describes an incident that relates to bookmark
    types:
    - uid: IncidentInfo
  - name: id
    isReadyOnly: true
    description: Azure resource Id
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: Azure resource name
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: Azure resource type
    types:
    - uid: string
  - name: etag
    description: Etag of the azure resource
    types:
    - uid: string
- name: ErrorResponse
  description: Error Response
  kind: object
  properties:
  - name: code
    isReadyOnly: true
    description: The error code.
    types:
    - uid: string
  - name: message
    isReadyOnly: true
    description: The error message.
    types:
    - uid: string
  - name: target
    isReadyOnly: true
    description: The error target.
    types:
    - uid: string
  - name: details
    isReadyOnly: true
    description: The error details.
    types:
    - uid: ErrorResponse
      isArray: true
  - name: additionalInfo
    isReadyOnly: true
    description: The error additional info.
    types:
    - uid: ErrorAdditionalInfo
      isArray: true
- name: UserInfo
  description: User information that made some action
  kind: object
  properties:
  - name: email
    isReadyOnly: true
    description: The email of the user.
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: The name of the user.
    types:
    - uid: string
  - name: objectId
    description: The object id of the user.
    types:
    - uid: string
- name: IncidentInfo
  description: Describes related incident information for the bookmark
  kind: object
  properties:
  - name: incidentId
    description: Incident Id
    types:
    - uid: string
  - name: severity
    description: The severity of the incident
    types:
    - uid: IncidentSeverity
  - name: title
    description: The title of the incident
    types:
    - uid: string
  - name: relationName
    description: Relation Name
    types:
    - uid: string
- name: ErrorAdditionalInfo
  description: The resource management error additional info.
  kind: object
  properties:
  - name: type
    isReadyOnly: true
    description: The additional info type.
    types:
    - uid: string
  - name: info
    isReadyOnly: true
    description: The additional info.
    types:
    - uid: object
- name: IncidentSeverity
  description: The severity of the incident
  kind: enum
  properties:
  - name: High
    description: High severity
    types:
    - uid: string
  - name: Medium
    description: Medium severity
    types:
    - uid: string
  - name: Low
    description: Low severity
    types:
    - uid: string
  - name: Informational
    description: Informational severity
    types:
    - uid: string
examples:
- name: Get all bookmarks.
  request:
    uri: GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks?api-version=2020-01-01
  responses:
  - statusCode: "200"
    body: >-
      {
        "value": [
          {
            "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/bookmarks/73e01a99-5cd7-4139-a149-9f2736ff2ab5",
            "name": "73e01a99-5cd7-4139-a149-9f2736ff2ab5",
            "type": "Microsoft.SecurityInsights/bookmarks",
            "etag": "\"0300bf09-0000-0000-0000-5c37296e0000\"",
            "properties": {
              "displayName": "My bookmark",
              "createdBy": {
                "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
                "email": "john@contoso.com",
                "name": "john doe"
              },
              "updatedBy": {
                "objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70",
                "email": "john@contoso.com",
                "name": "john doe"
              },
              "updated": "2019-01-01T13:15:30Z",
              "created": "2019-01-01T13:15:30Z",
              "notes": "Found a suspicious activity",
              "labels": [
                "Tag1",
                "Tag2"
              ],
              "query": "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
              "queryResult": "Security Event query result",
              "incidentInfo": {
                "incidentId": "DDA55F97-170B-40B9-B8ED-CBFD05481E7D",
                "severity": "Low",
                "title": "New case 1",
                "relationName": "4bb36b7b-26ff-4d1c-9cbe-0d8ab3da0018"
              }
            }
          }
        ]
      }
security:
- name: azure_auth
  type: oauth2
  description: Azure Active Directory OAuth2 Flow
  flow: implicit
  authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize
  scopes:
  - name: user_impersonation
    description: impersonate your user account
metadata:
  description: Learn more about Sentinel service - Gets all bookmarks.
errorCodes: []
