### YamlMime:RESTOperation
uid: management.azure.com.securityinsights.preview.entityqueries.get
name: Get
service: Sentinel
groupName: Entity Queries
apiVersion: 2022-07-01-preview
summary: Gets an entity query.
consumes:
- application/json
produces:
- application/json
paths:
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.OperationalInsights/workspaces/{workspaceName}/providers/Microsoft.SecurityInsights/entityQueries/{entityQueryId}?api-version=2022-07-01-preview
uriParameters:
- name: subscriptionId
  in: path
  isRequired: true
  description: The ID of the target subscription.
  types:
  - uid: string
- name: resourceGroupName
  in: path
  isRequired: true
  description: The name of the resource group. The name is case insensitive.
  types:
  - uid: string
- name: workspaceName
  in: path
  isRequired: true
  description: The name of the workspace.
  types:
  - uid: string
- name: entityQueryId
  in: path
  isRequired: true
  description: entity query ID
  types:
  - uid: string
- name: api-version
  in: query
  isRequired: true
  description: The API version to use for this operation.
  types:
  - uid: string
responses:
- name: 200 OK
  description: OK
  types:
  - uid: ExpansionEntityQuery
  - uid: ActivityEntityQuery
  typesTitle: EntityQuery
- name: Other Status Codes
  description: Error response describing why the operation failed.
  types:
  - uid: CloudError
requestHeader: []
definitions:
- name: CloudError
  description: Error response structure.
  kind: object
  properties:
  - name: error
    description: Error data
    types:
    - uid: CloudErrorBody
- name: ExpansionEntityQuery
  description: Represents Expansion entity query.
  kind: object
  properties:
  - name: properties.dataSources
    description: List of the data sources that are required to run the query
    types:
    - uid: string
      isArray: true
  - name: properties.displayName
    description: The query display name
    types:
    - uid: string
  - name: properties.inputEntityType
    description: The type of the query's source entity
    types:
    - uid: EntityType
  - name: properties.inputFields
    description: List of the fields of the source entity that are required to run the query
    types:
    - uid: string
      isArray: true
  - name: properties.outputEntityTypes
    description: List of the desired output types to be constructed from the result
    types:
    - uid: string
      isArray: true
  - name: properties.queryTemplate
    description: The template query string to be parsed and formatted
    types:
    - uid: string
  - name: kind
    description: the entity query kind
    types:
    - uid: Expansion
    typesTitle: string
  - name: etag
    description: Etag of the azure resource
    types:
    - uid: string
  - name: id
    isReadyOnly: true
    description: Fully qualified resource ID for the resource. Ex - /subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/{resourceProviderNamespace}/{resourceType}/{resourceName}
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: The name of the resource
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: The type of the resource. E.g. "Microsoft.Compute/virtualMachines" or "Microsoft.Storage/storageAccounts"
    types:
    - uid: string
  - name: systemData
    isReadyOnly: true
    description: Azure Resource Manager metadata containing createdBy and modifiedBy information.
    types:
    - uid: systemData
- name: ActivityEntityQuery
  description: Represents Activity entity query.
  kind: object
  properties:
  - name: properties.title
    description: The entity query title
    types:
    - uid: string
  - name: properties.content
    description: The entity query content to display in timeline
    types:
    - uid: string
  - name: properties.description
    description: The entity query description
    types:
    - uid: string
  - name: properties.queryDefinitions
    description: The Activity query definitions
    types:
    - uid: QueryDefinitions
  - name: properties.inputEntityType
    description: The type of the query's source entity
    types:
    - uid: EntityType
  - name: properties.requiredInputFieldsSets
    description: List of the fields of the source entity that are required to run the query
    types:
    - uid: array
      isArray: true
  - name: properties.entitiesFilter
    description: The query applied only to entities matching to all filters
    types:
    - uid: object
      isDictionary: true
      additionalTypes:
      - uid: string
      - uid: array
  - name: properties.templateName
    description: The template id this activity was created from
    types:
    - uid: string
  - name: properties.enabled
    description: Determines whether this activity is enabled or disabled.
    types:
    - uid: boolean
  - name: properties.createdTimeUtc
    isReadyOnly: true
    description: The time the activity was created
    types:
    - uid: string
  - name: properties.lastModifiedTimeUtc
    isReadyOnly: true
    description: The last time the activity was updated
    types:
    - uid: string
  - name: kind
    description: the entity query kind
    types:
    - uid: Activity
    typesTitle: string
  - name: etag
    description: Etag of the azure resource
    types:
    - uid: string
  - name: id
    isReadyOnly: true
    description: Fully qualified resource ID for the resource. Ex - /subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/{resourceProviderNamespace}/{resourceType}/{resourceName}
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: The name of the resource
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: The type of the resource. E.g. "Microsoft.Compute/virtualMachines" or "Microsoft.Storage/storageAccounts"
    types:
    - uid: string
  - name: systemData
    isReadyOnly: true
    description: Azure Resource Manager metadata containing createdBy and modifiedBy information.
    types:
    - uid: systemData
- name: CloudErrorBody
  description: Error details.
  kind: object
  properties:
  - name: code
    isReadyOnly: true
    description: An identifier for the error. Codes are invariant and are intended to be consumed programmatically.
    types:
    - uid: string
  - name: message
    isReadyOnly: true
    description: A message describing the error, intended to be suitable for display in a user interface.
    types:
    - uid: string
- name: EntityType
  description: The type of the query's source entity
  kind: enum
  properties:
  - name: Account
    description: Entity represents account in the system.
    types:
    - uid: string
  - name: Host
    description: Entity represents host in the system.
    types:
    - uid: string
  - name: File
    description: Entity represents file in the system.
    types:
    - uid: string
  - name: AzureResource
    description: Entity represents azure resource in the system.
    types:
    - uid: string
  - name: CloudApplication
    description: Entity represents cloud application in the system.
    types:
    - uid: string
  - name: DNS
    description: Entity represents dns in the system.
    types:
    - uid: string
  - name: FileHash
    description: Entity represents file hash in the system.
    types:
    - uid: string
  - name: IP
    description: Entity represents ip in the system.
    types:
    - uid: string
  - name: Malware
    description: Entity represents malware in the system.
    types:
    - uid: string
  - name: Process
    description: Entity represents process in the system.
    types:
    - uid: string
  - name: RegistryKey
    description: Entity represents registry key in the system.
    types:
    - uid: string
  - name: RegistryValue
    description: Entity represents registry value in the system.
    types:
    - uid: string
  - name: SecurityGroup
    description: Entity represents security group in the system.
    types:
    - uid: string
  - name: URL
    description: Entity represents url in the system.
    types:
    - uid: string
  - name: IoTDevice
    description: Entity represents IoT device in the system.
    types:
    - uid: string
  - name: SecurityAlert
    description: Entity represents security alert in the system.
    types:
    - uid: string
  - name: HuntingBookmark
    description: Entity represents HuntingBookmark in the system.
    types:
    - uid: string
  - name: MailCluster
    description: Entity represents mail cluster in the system.
    types:
    - uid: string
  - name: MailMessage
    description: Entity represents mail message in the system.
    types:
    - uid: string
  - name: Mailbox
    description: Entity represents mailbox in the system.
    types:
    - uid: string
  - name: SubmissionMail
    description: Entity represents submission mail in the system.
    types:
    - uid: string
  - name: Nic
    description: Entity represents network interface in the system.
    types:
    - uid: string
- name: EntityQueryKind
  description: The kind of the entity query
  kind: enum
  properties:
  - name: Expansion
    types:
    - uid: string
  - name: Insight
    types:
    - uid: string
  - name: Activity
    types:
    - uid: string
- name: systemData
  description: Metadata pertaining to creation and last modification of the resource.
  kind: object
  properties:
  - name: createdBy
    description: The identity that created the resource.
    types:
    - uid: string
  - name: createdByType
    description: The type of identity that created the resource.
    types:
    - uid: createdByType
  - name: createdAt
    description: The timestamp of resource creation (UTC).
    types:
    - uid: string
  - name: lastModifiedBy
    description: The identity that last modified the resource.
    types:
    - uid: string
  - name: lastModifiedByType
    description: The type of identity that last modified the resource.
    types:
    - uid: createdByType
  - name: lastModifiedAt
    description: The timestamp of resource last modification (UTC)
    types:
    - uid: string
- name: QueryDefinitions
  description: The Activity query definitions
  kind: object
  properties:
  - name: query
    description: The Activity query to run on a given entity
    types:
    - uid: string
- name: createdByType
  description: The type of identity that created the resource.
  kind: enum
  properties:
  - name: User
    types:
    - uid: string
  - name: Application
    types:
    - uid: string
  - name: ManagedIdentity
    types:
    - uid: string
  - name: Key
    types:
    - uid: string
examples:
- name: Get an Expansion entity query.
  request:
    uri: GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b?api-version=2022-07-01-preview
    codeTab: |+
      # [HTTP](#tab/HTTP)
      ``` http
      GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b?api-version=2022-07-01-preview
      ```

  responses:
  - statusCode: "200"
    body: >-
      {
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b",
        "name": "07da3cc8-c8ad-4710-a44e-334cdcb7882b",
        "type": "Microsoft.SecurityInsights/entityQueries",
        "etag": null,
        "kind": "Expansion",
        "properties": {
          "queryTemplate": "let GetParentProcessesOnHost = (v_Host_HostName:string){\r\n                            SecurityEvent \r\n                            | where EventID == 4688 \r\n                            | where isnotempty(ParentProcessName)\r\n                            | where NewProcessName !contains ':\\\\Windows\\\\System32\\\\conhost.exe' and ParentProcessName !contains ':\\\\Windows\\\\System32\\\\conhost.exe'\r\n                            and NewProcessName !contains ':\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.0.50727\\\\csc.exe' and ParentProcessName !contains ':\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.0.50727\\\\csc.exe'\r\n                            and NewProcessName !contains ':\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.0.50727\\\\cvtres.exe' and ParentProcessName !contains ':\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v2.0.50727\\\\cvtres.exe'\r\n                            and NewProcessName!contains ':\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHost.exe' and ParentProcessName !contains ':\\\\Program Files\\\\Microsoft Monitoring Agent\\\\Agent\\\\MonitoringHost.exe'\r\n                            and ParentProcessName !contains ':\\\\Windows\\\\CCM\\\\CcmExec.exe'\r\n                            | where(ParentProcessName !contains ':\\\\Windows\\\\System32\\\\svchost.exe' and (NewProcessName !contains ':\\\\Windows\\\\System32\\\\wbem\\\\WmiPrvSE.exe' or NewProcessName !contains ':\\\\Windows\\\\SysWOW64\\\\wbem\\\\WmiPrvSE.exe'))\r\n                            | where(ParentProcessName !contains ':\\\\Windows\\\\System32\\\\services.exe' and NewProcessName !contains ':\\\\Windows\\\\servicing\\\\TrustedInstaller.exe')\r\n                            | where toupper(Computer) contains v_Host_HostName or toupper(WorkstationName) contains v_Host_HostName\r\n                            | summarize min(TimeGenerated), max(TimeGenerated) by Account, Computer, ParentProcessName, NewProcessName, CommandLine, ProcessId\r\n                            | project min_TimeGenerated, max_TimeGenerated, Account, Computer, ParentProcessName, NewProcessName, CommandLine, ProcessId\r\n                            | project-rename Process_Host_UnstructuredName=Computer, Process_Account_UnstructuredName=Account, Process_CommandLine=CommandLine, Process_ProcessId=ProcessId, Process_ImageFile_FullPath=NewProcessName, Process_ParentProcess_ImageFile_FullPath=ParentProcessName\r\n                            | top 10 by min_TimeGenerated asc};\r\n                            GetParentProcessesOnHost(toupper('<hostName>'))",
          "inputFields": [
            "hostName"
          ],
          "outputEntityTypes": [
            "Process"
          ],
          "dataSources": [
            "SecurityEvent"
          ],
          "inputEntityType": "Host",
          "displayName": "Parent processes running on host"
        }
      }
- name: Get an Activity entity query.
  request:
    uri: GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b?api-version=2022-07-01-preview
    codeTab: |+
      # [HTTP](#tab/HTTP)
      ``` http
      GET https://management.azure.com/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b?api-version=2022-07-01-preview
      ```

  responses:
  - statusCode: "200"
    body: >-
      {
        "id": "/subscriptions/d0cfe6b2-9ac0-4464-9919-dccaee2e48c0/resourceGroups/myRg/providers/Microsoft.OperationalInsights/workspaces/myWorkspace/providers/Microsoft.SecurityInsights/entityQueries/07da3cc8-c8ad-4710-a44e-334cdcb7882b",
        "name": "07da3cc8-c8ad-4710-a44e-334cdcb7882b",
        "type": "Microsoft.SecurityInsights/entityQueries",
        "etag": null,
        "kind": "Activity",
        "properties": {
          "title": "An account was deleted on this host",
          "content": "On '{{Computer}}' the account '{{TargetAccount}}' was deleted by '{{AddedBy}}'",
          "description": "Account deleted on host",
          "queryDefinitions": {
            "query": "let GetAccountActions = (v_Host_Name:string, v_Host_NTDomain:string, v_Host_DnsDomain:string, v_Host_AzureID:string, v_Host_OMSAgentID:string){\nSecurityEvent\n| where EventID in (4725, 4726, 4767, 4720, 4722, 4723, 4724)\n// parsing for Host to handle variety of conventions coming from data\n| extend Host_HostName = case(\nComputer has '@', tostring(split(Computer, '@')[0]),\nComputer has '\\\\', tostring(split(Computer, '\\\\')[1]),\nComputer has '.', tostring(split(Computer, '.')[0]),\nComputer\n)\n| extend Host_NTDomain = case(\nComputer has '\\\\', tostring(split(Computer, '\\\\')[0]), \nComputer has '.', tostring(split(Computer, '.')[-2]), \nComputer\n)\n| extend Host_DnsDomain = case(\nComputer has '\\\\', tostring(split(Computer, '\\\\')[0]), \nComputer has '.', strcat_array(array_slice(split(Computer,'.'),-2,-1),'.'), \nComputer\n)\n| where (Host_HostName =~ v_Host_Name and Host_NTDomain =~ v_Host_NTDomain) \nor (Host_HostName =~ v_Host_Name and Host_DnsDomain =~ v_Host_DnsDomain) \nor v_Host_AzureID =~ _ResourceId \nor v_Host_OMSAgentID == SourceComputerId\n| project TimeGenerated, EventID, Activity, Computer, TargetAccount, TargetUserName, TargetDomainName, TargetSid, SubjectUserName, SubjectUserSid, _ResourceId, SourceComputerId\n| extend AddedBy = SubjectUserName\n// Future support for Activities\n| extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = TargetAccount\n};\nGetAccountActions('{{Host_HostName}}', '{{Host_NTDomain}}', '{{Host_DnsDomain}}', '{{Host_AzureID}}', '{{Host_OMSAgentID}}')\n \n| where EventID == 4726 "
          },
          "inputEntityType": "Host",
          "requiredInputFieldsSets": [
            [
              "Host_HostName",
              "Host_NTDomain"
            ],
            [
              "Host_HostName",
              "Host_DnsDomain"
            ],
            [
              "Host_AzureID"
            ],
            [
              "Host_OMSAgentID"
            ]
          ],
          "entitiesFilter": {
            "Host_OsFamily": [
              "Windows"
            ]
          },
          "enabled": true,
          "templateName": null,
          "createdTimeUtc": "2019-01-01T13:15:30Z",
          "lastModifiedTimeUtc": "2019-01-01T13:15:30Z"
        }
      }
security:
- name: azure_auth
  type: oauth2
  description: Azure Active Directory OAuth2 Flow
  flow: implicit
  authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize
  scopes:
  - name: user_impersonation
    description: impersonate your user account
metadata:
  description: Learn more about Sentinel service - Gets an entity query.
errorCodes: []
