### YamlMime:RESTOperation
uid: management.azure.com.securitycenter.iotsecuritysolutionsanalyticsaggregatedalert.list
name: List
service: Security Center
groupName: Iot Security Solutions Analytics Aggregated Alert
apiVersion: 2019-08-01
summary: Use this method to get the aggregated alert list of yours IoT Security solution.
consumes:
- application/json
produces:
- application/json
paths:
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts?api-version=2019-08-01
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts?api-version=2019-08-01&$top={$top}
  isOptional: true
uriParameters:
- name: subscriptionId
  in: path
  isRequired: true
  description: Azure subscription ID
  types:
  - uid: string
  pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$
- name: resourceGroupName
  in: path
  isRequired: true
  description: The name of the resource group within the user's subscription. The name is case insensitive.
  types:
  - uid: string
  pattern: ^[-\w\._\(\)]+$
- name: solutionName
  in: path
  isRequired: true
  description: The name of the IoT Security solution.
  types:
  - uid: string
- name: api-version
  in: query
  isRequired: true
  description: API version for the operation
  types:
  - uid: string
- name: $top
  in: query
  description: Number of results to retrieve.
  types:
  - uid: integer
responses:
- name: 200 OK
  description: OK
  types:
  - uid: IoTSecurityAggregatedAlertList
- name: Other Status Codes
  description: Error response describing why the operation failed.
  types:
  - uid: CloudError
requestHeader: []
definitions:
- name: IoTSecurityAggregatedAlertList
  description: List of IoT Security solution aggregated alert data.
  kind: object
  properties:
  - name: value
    description: List of aggregated alerts data.
    types:
    - uid: IoTSecurityAggregatedAlert
      isArray: true
  - name: nextLink
    isReadyOnly: true
    description: When there is too much alert data for one page, use this URI to fetch the next page.
    types:
    - uid: string
- name: CloudError
  description: Error response structure.
  kind: object
  properties:
  - name: error.code
    isReadyOnly: true
    description: An identifier for the error. Codes are invariant and are intended to be consumed programmatically.
    types:
    - uid: string
  - name: error.message
    isReadyOnly: true
    description: A message describing the error, intended to be suitable for display in a user interface.
    types:
    - uid: string
- name: IoTSecurityAggregatedAlert
  description: Security Solution Aggregated Alert information
  kind: object
  properties:
  - name: properties.alertType
    isReadyOnly: true
    description: Name of the alert type.
    types:
    - uid: string
  - name: properties.alertDisplayName
    isReadyOnly: true
    description: Display name of the alert type.
    types:
    - uid: string
  - name: properties.aggregatedDateUtc
    isReadyOnly: true
    description: Date of detection.
    types:
    - uid: string
  - name: properties.vendorName
    isReadyOnly: true
    description: Name of the organization that raised the alert.
    types:
    - uid: string
  - name: properties.reportedSeverity
    isReadyOnly: true
    description: Assessed alert severity.
    types:
    - uid: reportedSeverity
  - name: properties.remediationSteps
    isReadyOnly: true
    description: Recommended steps for remediation.
    types:
    - uid: string
  - name: properties.description
    isReadyOnly: true
    description: Description of the suspected vulnerability and meaning.
    types:
    - uid: string
  - name: properties.count
    isReadyOnly: true
    description: Number of alerts occurrences within the aggregated time window.
    types:
    - uid: integer
  - name: properties.effectedResourceType
    isReadyOnly: true
    description: Azure resource ID of the resource that received the alerts.
    types:
    - uid: string
  - name: properties.systemSource
    isReadyOnly: true
    description: The type of the alerted resource (Azure, Non-Azure).
    types:
    - uid: string
  - name: properties.actionTaken
    isReadyOnly: true
    description: IoT Security solution alert response.
    types:
    - uid: string
  - name: properties.logAnalyticsQuery
    isReadyOnly: true
    description: Log analytics query for getting the list of affected devices/alerts.
    types:
    - uid: string
  - name: properties.topDevicesList
    isReadyOnly: true
    description: 10 devices with the highest number of occurrences of this alert type, on this day.
    types:
    - uid: TopDevicesList
      isArray: true
  - name: id
    isReadyOnly: true
    description: Resource Id
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: Resource name
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: Resource type
    types:
    - uid: string
  - name: tags
    description: Resource tags
    types:
    - uid: object
      isDictionary: true
      additionalTypes:
      - uid: string
      - uid: string
- name: reportedSeverity
  description: Assessed Alert severity.
  kind: enum
  properties:
  - name: Informational
    types:
    - uid: string
  - name: Low
    types:
    - uid: string
  - name: Medium
    types:
    - uid: string
  - name: High
    types:
    - uid: string
- name: TopDevicesList
  description: 10 devices with the highest number of occurrences of this alert type, on this day.
  kind: object
  properties:
  - name: deviceId
    isReadyOnly: true
    description: Name of the device.
    types:
    - uid: string
  - name: alertsCount
    isReadyOnly: true
    description: Number of alerts raised for this device.
    types:
    - uid: integer
  - name: lastOccurrence
    isReadyOnly: true
    description: Most recent time this alert was raised for this device, on this day.
    types:
    - uid: string
examples:
- name: Get the aggregated alert list of yours IoT Security solution
  request:
    uri: GET https://management.azure.com/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/iotSecuritySolutions/default/analyticsModels/default/aggregatedAlerts?api-version=2019-08-01
  responses:
  - statusCode: "200"
    body: >-
      {
        "value": [
          {
            "id": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
            "name": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
            "type": "Microsoft.Security/IoTSecurityAggregatedAlert",
            "properties": {
              "alertType": "IoT_Bruteforce_Fail",
              "alertDisplayName": "Failed Bruteforce",
              "aggregatedDateUtc": "2019-02-02",
              "vendorName": "Microsoft",
              "reportedSeverity": "Low",
              "remediationSteps": "",
              "description": "Multiple unsuccsseful login attempts identified. A Bruteforce attack on the device failed.",
              "count": 50,
              "effectedResourceType": "IoT Device",
              "systemSource": "Devices",
              "actionTaken": "Detected",
              "logAnalyticsQuery": "SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub') and tolower(AlertName) == tolower('Custom Alert - number of device to cloud messages in MQTT protocol is not in the allowed range') | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties",
              "topDevicesList": [
                {
                  "deviceId": "testDevice1",
                  "alertsCount": 45,
                  "lastOccurrence": "10:42"
                },
                {
                  "deviceId": "testDevice2",
                  "alertsCount": 30,
                  "lastOccurrence": "15:42"
                }
              ]
            }
          },
          {
            "id": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Success/2019-02-02",
            "name": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Success/2019-02-02",
            "type": "Microsoft.Security/IoTSecurityAggregatedAlert",
            "properties": {
              "alertType": "IoT_Bruteforce_Success",
              "alertDisplayName": "Successful Bruteforce",
              "aggregatedDateUtc": "2019-02-02",
              "vendorName": "Microsoft",
              "reportedSeverity": "Low",
              "remediationSteps": "",
              "description": "Multiple unsuccsseful login attempts identified followed by a succssful login. A Bruteforce attack on the device was Successfule",
              "count": 600000,
              "effectedResourceType": "IoT Device",
              "systemSource": "Devices",
              "actionTaken": "Detected",
              "logAnalyticsQuery": "SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub') and tolower(AlertName) == tolower('Custom Alert - number of device to cloud messages in MQTT protocol is not in the allowed range') | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties",
              "topDevicesList": [
                {
                  "deviceId": "testDevice1",
                  "alertsCount": 12321,
                  "lastOccurrence": "10:42"
                },
                {
                  "deviceId": "testDevice2",
                  "alertsCount": 455,
                  "lastOccurrence": "15:42"
                }
              ]
            }
          }
        ]
      }
security:
- name: azure_auth
  type: oauth2
  description: Azure Active Directory OAuth2 Flow
  flow: implicit
  authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize
  scopes:
  - name: user_impersonation
    description: impersonate your user account
errorCodes: []
