### YamlMime:RESTOperation
uid: management.azure.com.securitycenter.iotsecuritysolutionsanalyticsaggregatedalert.get
name: Get
service: Security Center
groupName: Iot Security Solutions Analytics Aggregated Alert
apiVersion: 2019-08-01
summary: Use this method to get a single the aggregated alert of yours IoT Security solution. This aggregation is performed by alert name.
consumes:
- application/json
produces:
- application/json
paths:
- content: GET https://management.azure.com/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts/{aggregatedAlertName}?api-version=2019-08-01
uriParameters:
- name: subscriptionId
  in: path
  isRequired: true
  description: Azure subscription ID
  types:
  - uid: string
  pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$
- name: resourceGroupName
  in: path
  isRequired: true
  description: The name of the resource group within the user's subscription. The name is case insensitive.
  types:
  - uid: string
  pattern: ^[-\w\._\(\)]+$
- name: solutionName
  in: path
  isRequired: true
  description: The name of the IoT Security solution.
  types:
  - uid: string
- name: aggregatedAlertName
  in: path
  isRequired: true
  description: Identifier of the aggregated alert.
  types:
  - uid: string
- name: api-version
  in: query
  isRequired: true
  description: API version for the operation
  types:
  - uid: string
responses:
- name: 200 OK
  description: OK
  types:
  - uid: IoTSecurityAggregatedAlert
- name: Other Status Codes
  description: Error response describing why the operation failed.
  types:
  - uid: CloudError
requestHeader: []
definitions:
- name: IoTSecurityAggregatedAlert
  description: Security Solution Aggregated Alert information
  kind: object
  properties:
  - name: properties.alertType
    isReadyOnly: true
    description: Name of the alert type.
    types:
    - uid: string
  - name: properties.alertDisplayName
    isReadyOnly: true
    description: Display name of the alert type.
    types:
    - uid: string
  - name: properties.aggregatedDateUtc
    isReadyOnly: true
    description: Date of detection.
    types:
    - uid: string
  - name: properties.vendorName
    isReadyOnly: true
    description: Name of the organization that raised the alert.
    types:
    - uid: string
  - name: properties.reportedSeverity
    isReadyOnly: true
    description: Assessed alert severity.
    types:
    - uid: reportedSeverity
  - name: properties.remediationSteps
    isReadyOnly: true
    description: Recommended steps for remediation.
    types:
    - uid: string
  - name: properties.description
    isReadyOnly: true
    description: Description of the suspected vulnerability and meaning.
    types:
    - uid: string
  - name: properties.count
    isReadyOnly: true
    description: Number of alerts occurrences within the aggregated time window.
    types:
    - uid: integer
  - name: properties.effectedResourceType
    isReadyOnly: true
    description: Azure resource ID of the resource that received the alerts.
    types:
    - uid: string
  - name: properties.systemSource
    isReadyOnly: true
    description: The type of the alerted resource (Azure, Non-Azure).
    types:
    - uid: string
  - name: properties.actionTaken
    isReadyOnly: true
    description: IoT Security solution alert response.
    types:
    - uid: string
  - name: properties.logAnalyticsQuery
    isReadyOnly: true
    description: Log analytics query for getting the list of affected devices/alerts.
    types:
    - uid: string
  - name: properties.topDevicesList
    isReadyOnly: true
    description: 10 devices with the highest number of occurrences of this alert type, on this day.
    types:
    - uid: TopDevicesList
      isArray: true
  - name: id
    isReadyOnly: true
    description: Resource Id
    types:
    - uid: string
  - name: name
    isReadyOnly: true
    description: Resource name
    types:
    - uid: string
  - name: type
    isReadyOnly: true
    description: Resource type
    types:
    - uid: string
  - name: tags
    description: Resource tags
    types:
    - uid: object
      isDictionary: true
      additionalTypes:
      - uid: string
      - uid: string
- name: CloudError
  description: Common error response for all Azure Resource Manager APIs to return error details for failed operations. (This also follows the OData error response format.).
  kind: object
  properties:
  - name: error.code
    isReadyOnly: true
    description: The error code.
    types:
    - uid: string
  - name: error.message
    isReadyOnly: true
    description: The error message.
    types:
    - uid: string
  - name: error.target
    isReadyOnly: true
    description: The error target.
    types:
    - uid: string
  - name: error.details
    isReadyOnly: true
    description: The error details.
    types:
    - uid: CloudErrorBody
      isArray: true
  - name: error.additionalInfo
    isReadyOnly: true
    description: The error additional info.
    types:
    - uid: ErrorAdditionalInfo
      isArray: true
- name: reportedSeverity
  description: Assessed Alert severity.
  kind: enum
  properties:
  - name: Informational
    types:
    - uid: string
  - name: Low
    types:
    - uid: string
  - name: Medium
    types:
    - uid: string
  - name: High
    types:
    - uid: string
- name: TopDevicesList
  description: 10 devices with the highest number of occurrences of this alert type, on this day.
  kind: object
  properties:
  - name: deviceId
    isReadyOnly: true
    description: Name of the device.
    types:
    - uid: string
  - name: alertsCount
    isReadyOnly: true
    description: Number of alerts raised for this device.
    types:
    - uid: integer
  - name: lastOccurrence
    isReadyOnly: true
    description: Most recent time this alert was raised for this device, on this day.
    types:
    - uid: string
- name: CloudErrorBody
  description: The error detail.
  kind: object
  properties:
  - name: code
    isReadyOnly: true
    description: The error code.
    types:
    - uid: string
  - name: message
    isReadyOnly: true
    description: The error message.
    types:
    - uid: string
  - name: target
    isReadyOnly: true
    description: The error target.
    types:
    - uid: string
  - name: details
    isReadyOnly: true
    description: The error details.
    types:
    - uid: CloudErrorBody
      isArray: true
  - name: additionalInfo
    isReadyOnly: true
    description: The error additional info.
    types:
    - uid: ErrorAdditionalInfo
      isArray: true
- name: ErrorAdditionalInfo
  description: The resource management error additional info.
  kind: object
  properties:
  - name: type
    isReadyOnly: true
    description: The additional info type.
    types:
    - uid: string
  - name: info
    isReadyOnly: true
    description: The additional info.
    types:
    - uid: object
examples:
- name: Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name
  request:
    uri: GET https://management.azure.com/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/iotSecuritySolutions/default/analyticsModels/default/aggregatedAlerts/IoT_Bruteforce_Fail/2019-02-02?api-version=2019-08-01
    codeTab: |+
      # [HTTP](#tab/HTTP)
      ``` http
      GET https://management.azure.com/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/iotSecuritySolutions/default/analyticsModels/default/aggregatedAlerts/IoT_Bruteforce_Fail/2019-02-02?api-version=2019-08-01
      ```

      # [Go](#tab/Go)
      ``` go
      package armsecurity_test

      import (
      	"context"
      	"log"

      	"github.com/Azure/azure-sdk-for-go/sdk/azidentity"
      	"github.com/Azure/azure-sdk-for-go/sdk/resourcemanager/security/armsecurity"
      )

      // Generated from example definition: https://github.com/Azure/azure-rest-api-specs/tree/main/specification/security/resource-manager/Microsoft.Security/stable/2019-08-01/examples/IoTSecuritySolutionsAnalytics/GetIoTSecuritySolutionsSecurityAggregatedAlert.json
      func ExampleIotSecuritySolutionsAnalyticsAggregatedAlertClient_Get() {
      	cred, err := azidentity.NewDefaultAzureCredential(nil)
      	if err != nil {
      		log.Fatalf("failed to obtain a credential: %v", err)
      	}
      	ctx := context.Background()
      	client, err := armsecurity.NewIotSecuritySolutionsAnalyticsAggregatedAlertClient("20ff7fc3-e762-44dd-bd96-b71116dcdc23", cred, nil)
      	if err != nil {
      		log.Fatalf("failed to create client: %v", err)
      	}
      	res, err := client.Get(ctx,
      		"MyGroup",
      		"default",
      		"IoT_Bruteforce_Fail/2019-02-02",
      		nil)
      	if err != nil {
      		log.Fatalf("failed to finish the request: %v", err)
      	}
      	// TODO: use response item
      	_ = res
      }

      ```
      Read this [SDK documentation](https://github.com/Azure/azure-sdk-for-go/blob/sdk%2Fresourcemanager%2Fsecurity%2Farmsecurity%2Fv0.7.0/sdk/resourcemanager/security/armsecurity/README.md) on how to add the SDK to your project and authenticate.
      # [JavaScript](#tab/JavaScript)
      ``` js
      const { SecurityCenter } = require("@azure/arm-security");
      const { DefaultAzureCredential } = require("@azure/identity");

      /**
       * This sample demonstrates how to Use this method to get a single the aggregated alert of yours IoT Security solution. This aggregation is performed by alert name.
       *
       * @summary Use this method to get a single the aggregated alert of yours IoT Security solution. This aggregation is performed by alert name.
       * x-ms-original-file: specification/security/resource-manager/Microsoft.Security/stable/2019-08-01/examples/IoTSecuritySolutionsAnalytics/GetIoTSecuritySolutionsSecurityAggregatedAlert.json
       */
      async function getTheAggregatedSecurityAnalyticsAlertOfYoursIoTSecuritySolutionThisAggregationIsPerformedByAlertName() {
        const subscriptionId = "20ff7fc3-e762-44dd-bd96-b71116dcdc23";
        const resourceGroupName = "MyGroup";
        const solutionName = "default";
        const aggregatedAlertName = "IoT_Bruteforce_Fail/2019-02-02";
        const credential = new DefaultAzureCredential();
        const client = new SecurityCenter(credential, subscriptionId);
        const result = await client.iotSecuritySolutionsAnalyticsAggregatedAlert.get(
          resourceGroupName,
          solutionName,
          aggregatedAlertName
        );
        console.log(result);
      }

      getTheAggregatedSecurityAnalyticsAlertOfYoursIoTSecuritySolutionThisAggregationIsPerformedByAlertName().catch(
        console.error
      );

      ```
      Read this [SDK documentation](https://github.com/Azure/azure-sdk-for-js/blob/%40azure%2Farm-security_5.0.0/sdk/security/arm-security/README.md) on how to add the SDK to your project and authenticate.
  responses:
  - statusCode: "200"
    body: >-
      {
        "id": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
        "name": "/subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02",
        "type": "Microsoft.Security/iotSecuritySolutions/analyticsModels/aggregatedAlerts",
        "properties": {
          "alertType": "IoT_Bruteforce_Fail",
          "alertDisplayName": "Failed Bruteforce",
          "aggregatedDateUtc": "2019-02-02",
          "vendorName": "Microsoft",
          "reportedSeverity": "Low",
          "remediationSteps": "",
          "description": "Multiple unsuccsseful login attempts identified. A Bruteforce attack on the device failed.",
          "count": 50,
          "effectedResourceType": "IoT Device",
          "systemSource": "Devices",
          "actionTaken": "Detected",
          "logAnalyticsQuery": "SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub') and tolower(AlertName) == tolower('Custom Alert - number of device to cloud messages in MQTT protocol is not in the allowed range') | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties",
          "topDevicesList": [
            {
              "deviceId": "testDevice1",
              "alertsCount": 100,
              "lastOccurrence": "10:42"
            },
            {
              "deviceId": "testDevice2",
              "alertsCount": 80,
              "lastOccurrence": "15:42"
            }
          ]
        }
      }
security:
- name: azure_auth
  type: oauth2
  description: Azure Active Directory OAuth2 Flow
  flow: implicit
  authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize
  scopes:
  - name: user_impersonation
    description: impersonate your user account
metadata:
  description: >
    Use this method to get a single the aggregated alert of yours IoT Security solution. This aggregation is performed by alert name.
errorCodes: []
